РВ = РегВыр_Компилировать("a[bc]+d");
Колво = 10000;
Длина = 100;

ВсеСимволы = "";

Состояние("Генерация данных...");

Для С = 32 По 126 Цикл
	ВсеСимволы = ВсеСимволы + Символ(С);
КонецЦикла;

ТестМас = Новый Массив;
Ген = Новый ГенераторСлучайныхЧисел;
Для К = 0 По Колво-1 Цикл
	Буф = "";
	Для Л = 0 По Длина-1 Цикл
		Буф = Буф + Сред(ВсеСимволы, Ген.СлучайноеЧисло(1, СтрДлина(ВсеСимволы)), 1);
	КонецЦикла;
	ТестМас.Добавить(Буф);
КонецЦикла;

Состояние("Тест...");
Лог = "";

Начало = ТекущаяДата();
Для Каждого ТестСтрока Из ТестМас Цикл
	Лог = Лог + """" + ТестСтрока + """ ? " + РВ.Фасет + " -> " + Строка(РегВыр_Проверить(ТестСтрока, РВ)) + Символы.ПС;
КонецЦикла;
Конец = ТекущаяДата();

Разница = Конец - Начало;
ВырВСек = ТестМас.Количество() / Разница;

Сообщить(Строка(ТестМас.Количество()) + " строк - " + Строка(Разница) + " сек.");
Сообщить(Строка(ВырВСек) + " выр/сек.");
Сообщить(Строка(ВырВСек/Длина) + " cps");
