РВ = РегВыр_Компилировать("a[bc]+d");

ТестСтрока = "";
Сообщить("""" + ТестСтрока + """ ? " + РВ.Фасет + " -> " + Строка(РегВыр_Проверить(ТестСтрока, РВ)));

ТестСтрока = "abbbcd";
Сообщить("""" + ТестСтрока + """ ? " + РВ.Фасет + " -> " + Строка(РегВыр_Проверить(ТестСтрока, РВ)));

ТестСтрока = "23423423";
Сообщить("""" + ТестСтрока + """ ? " + РВ.Фасет + " -> " + Строка(РегВыр_Проверить(ТестСтрока, РВ)));

ТестСтрока = "aabbccdd";
Сообщить("""" + ТестСтрока + """ ? " + РВ.Фасет + " -> " + Строка(РегВыр_Проверить(ТестСтрока, РВ)));

ТестСтрока = "abccbbccbcbcd";
Сообщить("""" + ТестСтрока + """ ? " + РВ.Фасет + " -> " + Строка(РегВыр_Проверить(ТестСтрока, РВ)));
